---
kind: property
id: P:Autodesk.Revit.DB.Architecture.StairsType.MinRunWidth
source: html/3cfd44c9-9b82-bac2-a532-ad6eec073248.htm
---
# Autodesk.Revit.DB.Architecture.StairsType.MinRunWidth Property

The initial value for the width of a common run.

## Syntax (C#)
```csharp
public double MinRunWidth { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for minRunWidth must be greater than 0 and no more than 30000 feet.